# IsValidLineWeight Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegionType..::..IsValidLineWeight Method
FilledRegionType Class See Also
---
Indicates whether the given line weight value is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsValidLineWeight(
	int lineWeight
)
```

Visual Basic
---
```text
Public Shared Function IsValidLineWeight ( _
	lineWeight As Integer _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidLineWeight(
	int lineWeight
)
```

# ### Parameters
lineWeight
    Type: System..::..Int32 The line weight.
# ### Return Value
True if it is a valid line weight value, false otherwise.
# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace